Include("\\script\\skill\\head.lua")
SKILLS={
	AddLife={ --生命最大值
		lifemax_yan_v={{{1,100},{10,1000},{11,1000}},{{1,-1},{2,-1}}},
	},
	AddMana={ --内力最大值
		manamax_yan_v={{{1,2000},{2,2000}},{{1,-1},{2,-1}}},
	},
	AddSpeed={ --移动速度
		fastwalkrun_p={{{1,1},{20,20},{21,20}},{{1,-1},{2,-1}}},
	},
	AddSkillEnhance={ --攻击技能加成
		skill_enhance={{{1,1},{20,20},{21,20}},{{1,-1},{2,-1}}},
	},
	AddResistant={ --全抗
		allres_yan_p={{{1,1},{10,10},{11,10}},{{1,-1},{2,-1}}},
	},
	dixiaoshanghai={ --抵消伤害
		sorbdamage_yan_p={{{1,30},{2,30}},{{1,-1},{2,-1}}},
	},
	shoushanghuifu={ --受伤动作时间
		fasthitrecover_yan_v={{{1,1},{5,5},{6,5}},{{1,-1},{2,-1}}},
	},
	zhongji={ --加重击概率
		enhancehit_rate={{{1,1},{5,5},{6,5}},{{1,-1},{2,-1}}},
	},
	huluequankang={ --忽略全抗
		anti_allres_yan_p={{{1,1},{10,10},{11,10}},{{1,-1},{2,-1}}},
	},
	chaijiegedang={ --拆解格挡概率
		anti_block_rate={{{1,1},{5,5},{6,5}},{{1,-1},{2,-1}}},
	},
	AddGedang={ --格挡
		block_rate={{{1,10},{20,10}},{{1,-1},{2,-1}}},
	},
	AddSkillEnhance1={ --攻击技能加成
		skill_enhance={{{1,1},{10,10},{11,10}},{{1,-1},{2,-1}}},
	},
	AddLife1={ --生命最大值
		lifemax_yan_v={{{1,5000},{2,5000}},{{1,-1},{2,-1}}},
	},
	zhongji1={ --加重击概率
		enhancehit_rate={{{1,10},{2,10}},{{1,-1},{2,-1}}},
	},
	chaijiegedang1={ --拆解格挡概率
		anti_block_rate={{{1,10},{2,10}},{{1,-1},{2,-1}}},
	},
	--天下第一
	tianxiadiyi={
		block_rate={{{1,5},{20,5}},{{1,-1},{2,-1}}},
		allres_yan_p={{{1,15},{10,15},{11,15}},{{1,-1},{2,-1}}},
		anti_enhancehit_rate={{{1,10},{10,10},{11,10}},{{1,-1},{2,-1}}},
		anti_enhancehiteffect_rate={{{1,30},{10,30}},{{1,-1},{2,-1}}},
		lifemax_yan_v={{{1,15000},{10,15000},{11,15000}},{{1,-1},{2,-1}}},
	},
	--绝世高手
	jueshigaoshou={
		allres_yan_p={{{1,15},{10,15},{11,15}},{{1,-1},{2,-1}}},
		anti_enhancehit_rate={{{1,5},{10,5},{11,5}},{{1,-1},{2,-1}}},
		anti_enhancehiteffect_rate={{{1,20},{10,20}},{{1,-1},{2,-1}}},
		lifemax_yan_v={{{1,10000},{10,10000},{11,10000}},{{1,-1},{2,-1}}},
	},
	--武林高手
	wulingaoshou={
		allres_yan_p={{{1,10},{10,10},{11,10}},{{1,-1},{2,-1}}},
		anti_enhancehit_rate={{{1,5},{10,5},{11,5}},{{1,-1},{2,-1}}},
		anti_enhancehiteffect_rate={{{1,10},{10,10}},{{1,-1},{2,-1}}},
		lifemax_yan_v={{{1,10000},{10,10000},{11,10000}},{{1,-1},{2,-1}}},
	},
	--武林豪杰
	wulinhaojie={
		allres_yan_p={{{1,10},{10,10},{11,10}},{{1,-1},{2,-1}}},
		anti_enhancehit_rate={{{1,5},{10,5},{11,5}},{{1,-1},{2,-1}}},
		anti_enhancehiteffect_rate={{{1,10},{10,10}},{{1,-1},{2,-1}}},
		lifemax_yan_v={{{1,10000},{10,10000},{11,10000}},{{1,-1},{2,-1}}},
	},
	--金玉满堂
	jinyumantang={
		lifemax_yan_v={{{1,20000},{10,20000},{11,20000}},{{1,-1},{2,-1}}},
		skill_enhance={{{1,10},{10,10},{11,10}},{{1,-1},{2,-1}}},
		allres_yan_p={{{1,5},{10,5}},{{1,-1},{2,-1}}},
	},
	xiafenglunjianguanjun = { --侠峰论剑冠军
		lifemax_yan_v = {{{1,15000},{20,15000}},{{1,-1},{20,-1}}},--生命最大值（阳）
		vitality_v = {{{1,600},{2,600}},{{1,-1},{2,-1}}},--外功
		allres_yan_p = {{{1,10},{2,10}},{{1,-1},{2,-1}}},--全抗（阳）
		anti_block_rate={{{1,7},{2,7}},{{1,-1},{2,-1}}},--拆解格挡概率
		anti_enhancehit_rate={{{1,6},{2,6}},{{1,-1},{2,-1}}},--抵挡重击概率 
	},
	xiafenglunjianchaoji = { --侠峰论剑超级
		lifemax_yan_v = {{{1,10000},{20,10000}},{{1,-1},{20,-1}}},--生命最大值（阳）
		vitality_v = {{{1,400},{2,400}},{{1,-1},{2,-1}}},--外功
		allres_yan_p = {{{1,10},{2,10}},{{1,-1},{2,-1}}},--全抗（阳）
		anti_block_rate={{{1,7},{2,7}},{{1,-1},{2,-1}}},--拆解格挡概率
		anti_enhancehit_rate={{{1,4},{2,4}},{{1,-1},{2,-1}}},--抵挡重击概率 
	},
	xiafenglunjiangaoji = {  --侠峰论剑高级
		lifemax_yan_v = {{{1,10000},{20,10000}},{{1,-1},{20,-1}}},--生命最大值（阳）
		vitality_v = {{{1,200},{2,200}},{{1,-1},{2,-1}}},--外功
		allres_yan_p = {{{1,10},{2,10}},{{1,-1},{2,-1}}},--全抗（阳）
		anti_block_rate={{{1,7},{2,7}},{{1,-1},{2,-1}}},--拆解格挡概率
		anti_enhancehit_rate={{{1,2},{2,2}},{{1,-1},{2,-1}}},--抵挡重击概率 
	},
}